22-rails-auth/app/controllers/sessions_controller.rb

  def create #handles the POST request to /login
    # find out if we have a user with this username
    @user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "bangarang"], ["LIMIT", 1]]