22-rails-auth/app/controllers/users_controller.rb

  def create
    # byebug
    @user = User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "tim"], ["password_digest", "$2a$10$Rw/quXRacoJdF1/krmC0y.PLC5.tzUiFVRtcK.xwo/zc266iLT8tC"], ["created_at", "2019-05-24 18:02:40.578363"], ["updated_at", "2019-05-24 18:02:40.578363"]]

  def destroy # DELETE request /users/:id
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]