21-rails-session/app/controllers/application_controller.rb

  def see_the_items
    @items = Nacho.find(cart)
---
SELECT  "nachos".* FROM "nachos" WHERE "nachos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]